In [1]:
import pandas as pd

In [2]:
sdata1 = pd.Series([4,7,-5,2])
sdata1

0    4
1    7
2   -5
3    2
dtype: int64

In [3]:
sdata1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
sdata1.values

array([ 4,  7, -5,  2])

In [6]:
type(sdata1)

pandas.core.series.Series

In [8]:
sdata2 = pd.Series([4,7,-5,2], index = ['d','a','b','a'])
sdata2

d    4
a    7
b   -5
a    2
dtype: int64

In [10]:
sdata2['d']

4

In [12]:
sdata2[['b','d']]

b   -5
d    4
dtype: int64

In [13]:
sdata2['a']

a    7
a    2
dtype: int64

In [14]:
sdata2['a'] = 2000
sdata2

d       4
a    2000
b      -5
a    2000
dtype: int64

In [15]:
sdata2 >3

d     True
a     True
b    False
a     True
dtype: bool

In [16]:
sdata2[sdata2>3]

d       4
a    2000
a    2000
dtype: int64

In [18]:
import numpy as np
np.square(sdata2)

d         16
a    4000000
b         25
a    4000000
dtype: int64

In [19]:
sdata2 * 3

d      12
a    6000
b     -15
a    6000
dtype: int64

In [21]:
ddata = {'seoul':7800, 'busan': 5000, 'incheon':4500, 'suwon':3800}
ddata

{'seoul': 7800, 'busan': 5000, 'incheon': 4500, 'suwon': 3800}

In [22]:
sdata3 = pd.Series(ddata)
sdata3

seoul      7800
busan      5000
incheon    4500
suwon      3800
dtype: int64

In [24]:
frame1 = pd.DataFrame([[1,2,3],[4,5,6]]
                     ,index = ['one','two'],
                     columns=['first','second','third'])
frame1

     first  second  third
one      1       2      3
two      4       5      6

In [30]:
ldata1 = [('kim',188,30),('lee',170,20),('choi',160,50), ('oh',165,40)]
frame3 = pd.DataFrame(ldata1, columns = ['name','height','age'])

In [31]:
frame3

   name  height  age
0   kim     188   30
1   lee     170   20
2  choi     160   50
3    oh     165   40

In [32]:
ddata2 = {'state':['seoul','busan','incheon','daegu','suwon'],
         'year' :[2012,2015,2017,2019,2020],
          'pop' :[4.5,3.9,8.3,5.3,0.2]
         }
ddata2

{'state': ['seoul', 'busan', 'incheon', 'daegu', 'suwon'],
 'year': [2012, 2015, 2017, 2019, 2020],
 'pop': [4.5, 3.9, 8.3, 5.3, 0.2]}

In [36]:
frame3 = pd.DataFrame(ddata2)
frame3

     state  year  pop
0    seoul  2012  4.5
1    busan  2015  3.9
2  incheon  2017  8.3
3    daegu  2019  5.3
4    suwon  2020  0.2

In [41]:
frame4 = pd.DataFrame(ddata2, columns = ['year','pop','state'],
                     index = ['one','two','three','four','five'])
frame4

       year  pop    state
one    2012  4.5    seoul
two    2015  3.9    busan
three  2017  8.3  incheon
four   2019  5.3    daegu
five   2020  0.2    suwon

In [42]:
frame4['state']

one        seoul
two        busan
three    incheon
four       daegu
five       suwon
Name: state, dtype: object

In [43]:
frame4.state

one        seoul
two        busan
three    incheon
four       daegu
five       suwon
Name: state, dtype: object

In [46]:
frame4.loc['two']

year      2015
pop        3.9
state    busan
Name: two, dtype: object

In [47]:
frame4['year']['three']

2017

In [48]:
frame4.index.name = 'id'
frame4.columns.name = 'values'
frame4

values  year  pop    state
id
one     2012  4.5    seoul
two     2015  3.9    busan
three   2017  8.3  incheon
four    2019  5.3    daegu
five    2020  0.2    suwon

In [50]:
sdata1 = pd.Series([4,7,-2,3], index = list('dabc'))
sdata1

d    4
a    7
b   -2
c    3
dtype: int64

In [51]:
sdata2 = sdata1.reindex(['a','b','c','d','e'])
sdata2

a    7.0
b   -2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [52]:
sdata3 = sdata1.reindex(['a','b','c','d','e'], fill_value = 0)
sdata3

a    7
b   -2
c    3
d    4
e    0
dtype: int64

In [53]:
sdata4 = pd.Series(['red','green','blue'], index = [0,2,4])
sdata4

0      red
2    green
4     blue
dtype: object

In [56]:
sdata5 = sdata4.reindex(np.arange(6), method = 'ffill')
sdata5

0      red
1      red
2    green
3    green
4     blue
5     blue
dtype: object

In [57]:
sdata5 = sdata4.reindex(np.arange(6), fill_value = 0)
sdata5

0      red
1        0
2    green
3        0
4     blue
5        0
dtype: object

In [58]:
sdata1 = pd.Series(np.arange(5),index = list('abcde'))
sdata1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [62]:
sdata1.drop('c',inplace=True)

In [63]:
sdata1

a    0
b    1
d    3
e    4
dtype: int64

In [64]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
                     index= ['ohio','colo','texas'],
                     columns = ['one','two','three'])
frame1

       one  two  three
ohio     0    1      2
colo     3    4      5
texas    6    7      8

In [65]:
frame1.drop('ohio')

       one  two  three
colo     3    4      5
texas    6    7      8

In [67]:
frame1.drop(['two'], axis = 'columns')

       one  three
ohio     0      2
colo     3      5
texas    6      8

In [68]:
sdata2 = pd.Series([4,8,1,3,9], index = list('abcde'))
sdata2

a    4
b    8
c    1
d    3
e    9
dtype: int64

In [71]:
sdata2[2]

1

In [72]:
sdata2[1:3]

b    8
c    1
dtype: int64

In [73]:
sdata2['b':'d']

b    8
c    1
d    3
dtype: int64

In [107]:
frame2 = pd.DataFrame(np.arange(16).reshape(4,4),
                     index= ['ohio','colo','texas','utah'],
                     columns = ['one','two','three','four'])
frame2

       one  two  three  four
ohio     0    1      2     3
colo     4    5      6     7
texas    8    9     10    11
utah    12   13     14    15

In [75]:
frame2[1:3]

       one  two  three  four
colo     4    5      6     7
texas    8    9     10    11

In [86]:
frame2.iloc[0:,1:3]

       two  three
ohio     1      2
colo     5      6
texas    9     10
utah    13     14

In [97]:
frame2[1:]

       one  two  three  four
colo     4    5      6     7
texas    8    9     10    11
utah    12   13     14    15

In [92]:
frame2.iloc[3]

one      12
two      13
three    14
four     15
Name: utah, dtype: int64

In [99]:
frame2.iloc[]

one      12
two      13
three    14
four     15
Name: utah, dtype: int64

In [102]:
frame3 = pd.DataFrame(np.arange(12).reshape(3,4),
                      columns = list('abcd'))
frame4 = pd.DataFrame(np.arange(20).reshape(4,5),
                      columns = list('abcde'))
frame3

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [103]:
frame4

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [104]:
frame3+ frame4

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [105]:
frame3.add(frame4,fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [108]:
frame2

       one  two  three  four
ohio     0    1      2     3
colo     4    5      6     7
texas    8    9     10    11
utah    12   13     14    15

In [112]:
frame2[frame2.four > 10]

       one  two  three  four
texas    8    9     10    11
utah    12   13     14    15

In [113]:
frame2.four > 10

ohio     False
colo     False
texas     True
utah      True
Name: four, dtype: bool

In [116]:
(frame2.four > 10) & 1

ohio     False
colo     False
texas     True
utah      True
Name: four, dtype: bool

In [117]:
frame1 = pd.DataFrame(np.random.randn(4,3),
                     index = ['seoul','busan','incheon','suwon'],
                     columns = list('bde'))
frame1

                b         d         e
seoul    0.592409  0.732398  1.870901
busan   -0.104955  0.580278 -0.239057
incheon -0.700242  1.366259 -0.755951
suwon    0.764301 -0.376495  0.005598

In [120]:
f1 = lambda x : x.max() - x.min()
frame1.apply(f1, axis = 0)

b    1.464543
d    1.742754
e    2.626852
dtype: float64

In [121]:
frame1.apply(f1, axis = 1
            )

seoul      1.278491
busan      0.819335
incheon    2.122210
suwon      1.140795
dtype: float64

In [122]:
def f2(x) : 
    return pd.Series([x.min(),x.max()], index = ['min','max'])
frame1.apply(f2,axis =0)

            b         d         e
min -0.700242 -0.376495 -0.755951
max  0.764301  1.366259  1.870901

In [126]:
f3 = lambda x : '%.2f' % x
frame1.applymap(f3)

             b      d      e
seoul     0.59   0.73   1.87
busan    -0.10   0.58  -0.24
incheon  -0.70   1.37  -0.76
suwon     0.76  -0.38   0.01

In [127]:
frame1

                b         d         e
seoul    0.592409  0.732398  1.870901
busan   -0.104955  0.580278 -0.239057
incheon -0.700242  1.366259 -0.755951
suwon    0.764301 -0.376495  0.005598

In [128]:
frame1['e'].map(f3)

seoul       1.87
busan      -0.24
incheon    -0.76
suwon       0.01
Name: e, dtype: object

In [129]:
f3 = lambda x : '%.2f' % x
frame1.applymap(f3)

             b      d      e
seoul     0.59   0.73   1.87
busan    -0.10   0.58  -0.24
incheon  -0.70   1.37  -0.76
suwon     0.76  -0.38   0.01

In [130]:
f2 = lambda x : '%.2f' % x
frame1.apply(f2)

TypeError: cannot convert the series to <class 'float'>